<a href="https://colab.research.google.com/github/anshuldaksh2016/Machine_learning/blob/master/Feature_Engineering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Lifecycle of  Data science project
    - Data collection
    - Feature Engineering
          - Handling missing values 
          - Dataset should be collected from different sources 
          - missing data 
                > Continous data 
                > Categorical data

#What are the different type of Missing data  :-
      - Missing completely at random 
      - Missing data not at rndom

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('/content/titanic_train.csv')

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df [df['Embarked'].isnull()]

# this is the example of missing completely at random

     PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
61            62         1       1  ...  80.0   B28       NaN
829          830         1       1  ...  80.0   B28       NaN

[2 rows x 12 columns]

In [ ]:
## Missing data not at random (MNAR) systematic missing values 

#--- there is absolutely some relationship between the data missing and any other values

In [ ]:
import numpy as np

df['Cabin_null'] = np.where(df['Cabin'].isnull() ,1,0)

## find the percentage of NAN values
df['Cabin_null'].mean()

0.7710437710437711

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Cabin_null'],
      dtype='object')

In [ ]:
df['Cabin_null']

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    1
889    0
890    1
Name: Cabin_null, Length: 891, dtype: int64

In [ ]:
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: Cabin_null, dtype: float64

##Missing at random (MAR)

### all the techniques of handling missing values

    - > Mean median mode 
    - > Random sample imputation
    - > Capturing NAN values with a new features 
    - > End of distribution imputation 
    - > Arbitrary imputation 
    - > Frequent categories imputation